Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وكلا نقص عليك من أنباء الرسل ما نثبت به فؤادك وجاءك في هذه الحق وموعظة وذكرى للمؤمنين
en: And all that We relate to you (O Muhammad صلى الله عليه و سلم) of the news of the Messengers is in order that We may make strong and firm your heart thereby. And in this (chapter of the Qur'an) has come to you the truth, as well as an admonition and a reminder for the believers.

source: وقل للذين لا يؤمنون اعملوا على مكانتكم إنا عاملون
en: And say to those who do not believe: "Act according to your ability and way, We are acting (in our way).

source: وانتظروا إنا منتظرون
en: And you wait! We (too) are waiting."

source: ولله غيب السماوات والأرض وإليه يرجع الأمر كله فاعبده وتوكل عليه وما ربك بغافل عما تعملون
en: And to Allah belongs the Ghaib (Unseen) of the heavens and the earth, and to Him return all affairs (for decision). So worship Him (O Muhammad صلى الله عليه و سلم) and put your trust in Him. And your Lord is not unaware of what you (people) do.

source: الر تلك آيات الكتاب المبين
en: Alif-Lam-Ra. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. These are the Verses of the Clear Book (the Qur'an that makes clear the legal and illegal things, laws, a guidance and a blessing).

source: إنا أنزلناه قرآنا عربيا لعلكم تعقلون
en: Verily, We have sent it down as an Arabic Qur'an in order that you may understand.

source: نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين
en: We relate unto you (Muhammad صلى الله عليه و سلم) the best of stories through Our Revelations unto you, of this Qur'an. And before this (i.e. before the coming of Divine Revelation to you), you were among those who knew nothing about it (the Qur'an).

source: إذ قال يوسف لأبيه يا أبت إني رأيت أحد عشر كوكبا والشمس والقمر رأيتهم لي ساجدين
en: (Remember) when Yusuf (Joseph) said to his father: "O my father! Verily, I saw (in a dream) eleven stars and the sun and the moon - I saw them prostrating themselves to me."

source: قال يا بني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين
en: He (the father) said: "O my son! Relate not your vision to your brothers, lest they should arrange a plot against you. Verily! Shaitan (Satan) is to man an open enemy!

source: وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم
en: "Thus will your Lord choose you and teach you the interpretation of dreams (and other things) and perfect His Favour on you and on the offspring of Ya'qub (Jacob), as He perfected it on your fathers, Ibrahim (Abraham) and Ishaq (Isaac) aforetime! Verily, your Lord is All-Knowing, All-Wise."

source: لقد كان في يوسف وإخوته آيات للسائلين
en: Verily, in Yusuf (Joseph) and his brethren, there were Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) for those who ask.

source: إذ قالوا ليوسف وأخوه أحب إلى أبينا منا ونحن عصبة إن أبانا لفي ضلال مبين
en: When they said: "Truly, Yusuf (Joseph) and his brother (Benjamin) are dearer to our father than we, while we are a strong group. Really, our father is in a plain error.

source: اقتلوا يوسف أو اطرحوه أرضا يخل لكم وجه أبيكم وتكونوا من بعده قوما صالحين
en: "Kill Yusuf (Joseph) or cast him out to some (other) land, so that the favour of your father may be given to you alone, and after that you will be righteous folk (by intending repentance before committing the sin)."

source: قال قائل منهم لا تقتلوا يوسف وألقوه في غيابت الجب يلتقطه بعض السيارة إن كنتم فاعلين
en: One from among them said: "Kill not Yusuf (Joseph), but if you must do something, throw him down to the bottom of a well; he will be picked up by some caravan of travellers."

source: قالوا يا أبانا ما لك لا تأمنا على يوسف وإنا له لناصحون
en: They said: "O our father! Why do you not trust us with Yusuf (Joseph) though we are indeed his well-wishers?"

source: أرسله معنا غدا يرتع ويلعب وإنا له لحافظون
en: "Send him with us tomorrow to enjoy himself and play, and verily, we will take care of him."

source: قال إني ليحزنني أن تذهبوا به وأخاف أن يأكله الذئب وأنتم عنه غافلون
en: He [Ya'qub (Jacob)] said: "Truly, it saddens me that you should take him away. I fear lest a wolf should devour him, while you are careless of him."

source: قالوا لئن أكله الذئب ونحن عصبة إنا إذا لخاسرون
en: They said: "If a wolf devours him, while we are a strong group (to guard him), then surely, we are the losers."

source: فلما ذهبوا به وأجمعوا أن يجعلوه في غيابت الجب وأوحينا إليه لتنبئنهم بأمرهم هذا وهم لا يشعرون
en: So, when they took him away and they all agreed to throw him down to the bottom of the well, (they did so) and We revealed to him: "Indeed, you shall (one day) inform them of this their affair, when they know (you) not."

source: وجاءوا أباهم عشاء يبكون
en: And they came to their father in the early part of the night weeping.

source: قالوا يا أبانا إنا ذهبنا نستبق وتركنا يوسف عند متاعنا فأكله الذئب وما أنت بمؤمن لنا ولو كنا صادقين
en: They said: "O our father! We went racing with one another, and left Yusuf (Joseph) by our belongings and a wolf devoured him; but you will never believe us even when we speak the truth."

source: وجاءوا على قميصه بدم كذب قال بل سولت لكم أنفسكم أمرا فصبر جميل والله المستعان على ما تصفون
en: And they brought his shirt stained with false blood. He said: "Nay, but your ownselves have made up a tale. So (for me) patience is most fitting. And it is Allah (Alone) Whose help can be sought against that (lie) which you describe."

source: وجاءت سيارة فأرسلوا واردهم فأدلى دلوه قال يا بشرى هذا غلام وأسروه بضاعة والله عليم بما يعملون
en: And there came a caravan of travellers and they sent their water-drawer, and he let down his bucket (into the well). He said: "What good news! Here is a boy." So they hid him as merchandise (a slave). And Allah was the All-Knower of what they did.

source: وشروه بثمن بخس دراهم معدودة وكانوا فيه من الزاهدين
en: And they sold him for a low price - for a few Dirhams (i.e. for a few silver coins). And they were of those who regarded him insignificant.

source: وقال الذي اشتراه من مصر لامرأته أكرمي مثواه عسى أن ينفعنا أو نتخذه ولدا وكذلك مكنا ليوسف في الأرض ولنعلمه من تأويل الأحاديث والله غالب على أمره ولكن أكثر الناس لا يعلمون
en: And he (the man) from Egypt who bought him, said to his wife: "Make his stay comfortable, may be he will profit us or we shall adopt him as a son." Thus did We establish Yusuf (Joseph) in the land, that We might teach him the interpretation of events. And Allah has full power and control over His Affairs, but most of men know not.

source: ولما بلغ أشده آتيناه حكما وعلما وكذلك نجزي المحسنين
en: And when he [Yusuf (Joseph)] attained his full manhood, We gave him wisdom and knowledge (the Prophethood); thus We reward the Muhsinun (doers of good - see the footnote of V.9:120).

source: وراودته التي هو في بيتها عن نفسه وغلقت الأبواب وقالت هيت لك قال معاذ الله إنه ربي أحسن مثواي إنه لا يفلح الظالمون
en: And she, in whose house he was, sought to seduce him (to do an evil act), and she closed the doors and said: "Come on, O you." He said: "I seek refuge in Allah (or Allah forbid)! Truly, he (your husband) is my master! He made my living in a great comfort! (So I will never betray him). Verily, the Zalimun (wrong and evil-doers) will never be successful."

source: ولقد همت به وهم بها لولا أن رأى برهان ربه كذلك لنصرف عنه السوء والفحشاء إنه من عبادنا المخلصين
en: And indeed she did desire him, and he would have inclined to her desire, had he not seen the evidence of his Lord. Thus it was, that We might turn away from him evil and illegal sexual intercourse. Surely, he was one of Our chosen (guided) slaves.

source: واستبقا الباب وقدت قميصه من دبر وألفيا سيدها لدى الباب قالت ما جزاء من أراد بأهلك سوءا إلا أن يسجن أو عذاب أليم
en: So they raced with one another to the door, and she tore his shirt from the back. They both found her lord (i.e. her husband) at the door. She said: "What is the recompense (punishment) for him who intended an evil design against your wife, except that he be put in prison or a painful torment?"

source: قال هي راودتني عن نفسي وشهد شاهد من أهلها إن كان قميصه قد من قبل فصدقت وهو من الكاذبين
en: He [Yusuf (Joseph)] said: "It was she that sought to seduce me;" and a witness of her household bore witness (saying): "If it be that his shirt is torn from the front, then her tale is true and he is a liar!

source: وإن كان قميصه قد من دبر فكذبت وهو من الصادقين
en: "But if it be that his shirt is torn from the back, then she has told a lie and he is speaking the truth!"

source: فلما رأى قميصه قد من دبر قال إنه من كيدكن إن كيدكن عظيم
en: So when he (her husband) saw his [(Yusuf's (Joseph)] shirt torn at the back, he (her husband) said: "Surely, it is a plot of you women! Certainly mighty is your plot!

source: يوسف أعرض عن هذا واستغفري لذنبك إنك كنت من الخاطئين
en: "O Yusuf (Joseph)! Turn away from this! (O woman!) Ask forgiveness for your sin. Verily, you were of the sinful."

source: وقال نسوة في المدينة امرأت العزيز تراود فتاها عن نفسه قد شغفها حبا إنا لنراها في ضلال مبين
en: And women in the city said: "The wife of Al-'Aziz is seeking to seduce her (slave) young man, indeed she loves him violently; verily we see her in plain error."

source: فلما سمعت بمكرهن أرسلت إليهن وأعتدت لهن متكأ وآتت كل واحدة منهن سكينا وقالت اخرج عليهن فلما رأينه أكبرنه وقطعن أيديهن وقلن حاش لله ما هذا بشرا إن هذا إلا ملك كريم
en: So when she heard of their accusation, she sent for them and prepared a banquet for them; she gave each one of them a knife (to cut the foodstuff with), and she said [(to Yusuf (Joseph)]: "Come out before them." Then, when they saw him, they exalted him (at his beauty) and (in their astonishment) cut their hands. They said: "How perfect is Allah (or Allah forbid)! No man is this! This is none other than a noble angel!"

source: قالت فذلكن الذي لمتنني فيه ولقد راودته عن نفسه فاستعصم ولئن لم يفعل ما آمره ليسجنن وليكونا من الصاغرين
en: She said: "This is he (the young man) about whom you did blame me, and I did seek to seduce him, but he refused. And now if he refuses to obey my order, he shall certainly be cast into prison, and will be one of those who are disgraced."

source: قال رب السجن أحب إلي مما يدعونني إليه وإلا تصرف عني كيدهن أصب إليهن وأكن من الجاهلين
en: He said: "O my Lord! Prison is dearer to me than that to which they invite me. Unless You turn away their plot from me, I will feel inclined towards them and be one (of those who commit sin and deserve blame or those who do deeds) of the ignorant."

source: فاستجاب له ربه فصرف عنه كيدهن إنه هو السميع العليم
en: So his Lord answered his invocation and turned away from him their plot. Verily, He is the All-Hearer, the All-Knower.

source: ثم بدا لهم من بعد ما رأوا الآيات ليسجننه حتى حين
en: Then it occurred to them, after they had seen the proofs (of his innocence), to imprison him for a time.

source: ودخل معه السجن فتيان قال أحدهما إني أراني أعصر خمرا وقال الآخر إني أراني أحمل فوق رأسي خبزا تأكل الطير منه نبئنا بتأويله إنا نراك من المحسنين
en: And there entered with him two young men in the prison. One of them said: "Verily, I saw myself (in a dream) pressing wine." The other said: "Verily, I saw myself (in a dream) carrying bread on my head and birds were eating thereof." (They said): "Inform us of the interpretation of this. Verily, we think you are one of the Muhsinun (doers of good)."

source: قال لا يأتيكما طعام ترزقانه إلا نبأتكما بتأويله قبل أن يأتيكما ذلكما مما علمني ربي إني تركت ملة قوم لا يؤمنون بالله وهم بالآخرة هم كافرون
en: He said: "No food will come to you (in wakefulness or in dream) as your provision, but I will inform (in wakefulness) its interpretation before it (the food) comes. This is of that which my Lord has taught me. Verily, I have abandoned the religion of a people that believe not in Allah and are disbelievers in the Hereafter (i.e. the Kan'anyyun of Egypt who were polytheists and used to worship sun and other false deities).

source: واتبعت ملة آبائي إبراهيم وإسحاق ويعقوب ما كان لنا أن نشرك بالله من شيء ذلك من فضل الله علينا وعلى الناس ولكن أكثر الناس لا يشكرون
en: "And I have followed the religion of my fathers, - Ibrahim (Abraham), Ishaq (Isaac) and Ya'qub (Jacob) [عليهم السلام], and never could we attribute any partners whatsoever to Allah. This is from the Grace of Allah to us and to mankind, but most men thank not (i.e. they neither believe in Allah, nor worship Him).

source: يا صاحبي السجن أأرباب متفرقون خير أم الله الواحد القهار
en: "O two companions of the prison! Are many different lords (gods) better or Allah, the One, the Irresistible?

source: ما تعبدون من دونه إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن الحكم إلا لله أمر ألا تعبدوا إلا إياه ذلك الدين القيم ولكن أكثر الناس لا يعلمون
en: "You do not worship besides Him but only names which you have named (forged) - you and your fathers - for which Allah has sent down no authority. The command (or the judgement) is for none but Allah. He has commanded that you worship none but Him (i.e. His Monotheism); that is the (true) straight religion, but most men know not.

source: يا صاحبي السجن أما أحدكما فيسقي ربه خمرا وأما الآخر فيصلب فتأكل الطير من رأسه قضي الأمر الذي فيه تستفتيان
en: "O two companions of the prison! As for one of you, he (as a servant) will pour out wine for his lord (king or master) to drink; and as for the other, he will be crucified and birds will eat from his head. Thus is the case judged concerning which you both did inquire."

source: وقال للذي ظن أنه ناج منهما اذكرني عند ربك فأنساه الشيطان ذكر ربه فلبث في السجن بضع سنين
en: And he said to the one whom he knew to be saved: "Mention me to your lord (i.e. your king, so as to get me out of the prison)." But Shaitan (Satan) made him forget to mention it to his Lord [or Satan made Yusuf (Joseph) to forget the remembrance of his Lord (Allah) as to ask for His Help, instead of others]. So [Yusuf (Joseph)] stayed in prison a few (more) years.

source: وقال الملك إني أرى سبع بقرات سمان يأكلهن سبع عجاف وسبع سنبلات خضر وأخر يابسات يا أيها الملأ أفتوني في رؤياي إن كنتم للرؤيا تعبرون
en: And the king (of Egypt) said: "Verily, I saw (in a dream) seven fat cows, whom seven lean ones were devouring, and seven green ears of corn, and (seven) others dry. O notables! Explain to me my dream, if it be that you can interpret dreams."

source: قالوا أضغاث أحلام وما نحن بتأويل الأحلام بعالمين
en: They said: "Mixed up false dreams and we are not skilled in the interpretation of dreams."

source: وقال الذي نجا منهما وادكر بعد أمة أنا أنبئكم بتأويله فأرسلون
en: Then the man who was released (one of the two who were in prison), now at length remembered and said: "I will tell you its interpretation, so send me forth."

source: يوسف أيها الصديق أفتنا في سبع بقرات سمان يأكلهن سبع عجاف وسبع سنبلات خضر وأخر يابسات لعلي أرجع إلى الناس لعلهم يعلمون
en: (He said): "O Yusuf (Joseph), the man of truth! Explain to us (the dream) of seven fat cows whom seven lean ones were devouring, and of seven green ears of corn, and (seven) others dry, that I may return to the people, and that they may know."

source: قال تزرعون سبع سنين دأبا فما حصدتم فذروه في سنبله إلا قليلا مما تأكلون
en: [(Yusuf (Joseph)] said: "For seven consecutive years, you shall sow as usual and that (the harvest) which you reap you shall leave it in the ears, (all) except a little of it which you may eat.

source: ثم يأتي من بعد ذلك سبع شداد يأكلن ما قدمتم لهن إلا قليلا مما تحصنون
en: "Then will come after that, seven hard (years), which will devour what you have laid by in advance for them, (all) except a little of that which you have guarded (stored).

source: ثم يأتي من بعد ذلك عام فيه يغاث الناس وفيه يعصرون
en: "Then thereafter will come a year in which people will have abundant rain and in which they will press (wine and oil)."

source: وقال الملك ائتوني به فلما جاءه الرسول قال ارجع إلى ربك فاسأله ما بال النسوة اللاتي قطعن أيديهن إن ربي بكيدهن عليم
en: And the king said: "Bring him to me." But when the messenger came to him, [Yusuf (Joseph)] said: "Return to your lord and ask him, 'What happened to the women who cut their hands? Surely, my Lord (Allah) is Well-Aware of their plot.'"

source: قال ما خطبكن إذ راودتن يوسف عن نفسه قلن حاش لله ما علمنا عليه من سوء قالت امرأت العزيز الآن حصحص الحق أنا راودته عن نفسه وإنه لمن الصادقين
en: (The King) said (to the women): "What was your affair when you did seek to seduce Yusuf (Joseph)?" The women said: "Allah forbid! No evil know we against him!" The wife of Al-'Aziz said: "Now the truth is manifest (to all); it was I who sought to seduce him, and he is surely of the truthful."

source: ذلك ليعلم أني لم أخنه بالغيب وأن الله لا يهدي كيد الخائنين
en: [Then Yusuf (Joseph) said: "I asked for this enquiry] in order that he (Al-'Aziz) may know that I betrayed him not in (his) absence". And, verily! Allah guides not the plot of the betrayers.

source: وما أبرئ نفسي إن النفس لأمارة بالسوء إلا ما رحم ربي إن ربي غفور رحيم
en: "And I free not myself (from the blame). Verily, the (human) self is inclined to evil, except when my Lord bestows His Mercy (upon whom He wills). Verily, my Lord is Oft-Forgiving, Most Merciful."

source: وقال الملك ائتوني به أستخلصه لنفسي فلما كلمه قال إنك اليوم لدينا مكين أمين
en: And the king said: "Bring him to me that I may attach him to my person." Then, when he spoke to him, he said: "Verily, this day, you are with us high in rank and fully trusted."

source: قال اجعلني على خزائن الأرض إني حفيظ عليم
en: [Yusuf (Joseph)] said: "Set me over the store-houses of the land; I will indeed guard them with full knowledge" (as a minister of finance in Egypt).

source: وكذلك مكنا ليوسف في الأرض يتبوأ منها حيث يشاء نصيب برحمتنا من نشاء ولا نضيع أجر المحسنين
en: Thus did We give full authority to Yusuf (Joseph) in the land, to take possession therein, when or where he likes. We bestow of Our Mercy on whom We will, and We make not to be lost the reward of Al-Muhsinun (the good doers - See V.2:112).

source: ولأجر الآخرة خير للذين آمنوا وكانوا يتقون
en: And verily, the reward of the Hereafter is better for those who believe and used to fear Allah and keep their duty to Him (by abstaining from all kinds of sins and evil deeds and by performing all kinds of righteous good deeds).

source: وجاء إخوة يوسف فدخلوا عليه فعرفهم وهم له منكرون
en: And Yusuf's (Joseph) brethren came and they entered unto him, and he recognized them, but they recognized him not.

source: ولما جهزهم بجهازهم قال ائتوني بأخ لكم من أبيكم ألا ترون أني أوفي الكيل وأنا خير المنزلين
en: And when he had furnished them with their provisions (according to their need), he said: "Bring me a brother of yours from your father (he meant Benjamin). See you not that I give full measure, and that I am the best of the hosts?

source: فإن لم تأتوني به فلا كيل لكم عندي ولا تقربون
en: "But if you bring him not to me, there shall be no measure (of corn) for you with me, nor shall you come near me."

source: قالوا سنراود عنه أباه وإنا لفاعلون
en: They said: "We shall try to get permission (for him) from his father, and verily, we shall do it."

source: وقال لفتيانه اجعلوا بضاعتهم في رحالهم لعلهم يعرفونها إذا انقلبوا إلى أهلهم لعلهم يرجعون
en: And [Yusuf (Joseph)] told his servants to put their money (with which they had bought the corn) into their bags, so that they might know it when they go back to their people; in order they might come again.

source: فلما رجعوا إلى أبيهم قالوا يا أبانا منع منا الكيل فأرسل معنا أخانا نكتل وإنا له لحافظون
en: So, when they returned to their father, they said: "O our father! No more measure of grain shall we get (unless we take our brother). So send our brother with us, and we shall get our measure and truly we will guard him."

source: قال هل آمنكم عليه إلا كما أمنتكم على أخيه من قبل فالله خير حافظا وهو أرحم الراحمين
en: He said: "Can I entrust him to you except as I entrusted his brother [Yusuf (Joseph)] to you aforetime? But Allah is the Best to guard, and He is the Most Merciful of those who show mercy."

source: ولما فتحوا متاعهم وجدوا بضاعتهم ردت إليهم قالوا يا أبانا ما نبغي هذه بضاعتنا ردت إلينا ونمير أهلنا ونحفظ أخانا ونزداد كيل بعير ذلك كيل يسير
en: And when they opened their bags, they found their money had been returned to them. They said: "O our father! What (more) can we desire? This, our money has been returned to us; so we shall get (more) food for our family, and we shall guard our brother and add one more measure of a camel's load. This quantity is easy (for the king to give)."

source: قال لن أرسله معكم حتى تؤتون موثقا من الله لتأتنني به إلا أن يحاط بكم فلما آتوه موثقهم قال الله على ما نقول وكيل
en: He [Ya'qub (Jacob)] said: "I will not send him with you until you swear a solemn oath to me in Allah's Name, that you will bring him back to me unless you are yourselves surrounded (by enemies)," And when they had sworn their solemn oath, he said: "Allah is the Witness to what we have said."

source: وقال يا بني لا تدخلوا من باب واحد وادخلوا من أبواب متفرقة وما أغني عنكم من الله من شيء إن الحكم إلا لله عليه توكلت وعليه فليتوكل المتوكلون
en: And he said: "O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allah at all. Verily! The decision rests only with Allah. In Him, I put my trust and let all those that trust, put their trust in Him."

source: ولما دخلوا من حيث أمرهم أبوهم ما كان يغني عنهم من الله من شيء إلا حاجة في نفس يعقوب قضاها وإنه لذو علم لما علمناه ولكن أكثر الناس لا يعلمون
en: And when they entered according to their father's advice, it did not avail them in the least against (the Will of) Allah; it was but a need of Ya'qub's (Jacob) inner-self which he discharged. And verily, he was endowed with knowledge because We had taught him, but most men know not.

source: ولما دخلوا على يوسف آوى إليه أخاه قال إني أنا أخوك فلا تبتئس بما كانوا يعملون
en: And when they went in before Yusuf (Joseph), he took his brother (Benjamin) to himself and said: "Verily! I am your brother, so grieve not for what they used to do."

source: فلما جهزهم بجهازهم جعل السقاية في رحل أخيه ثم أذن مؤذن أيتها العير إنكم لسارقون
en: So when he had furnished them forth with their provisions, he put the (golden) bowl in his brother's bag. Then a crier cried: "O you (in) the caravan! Surely, you are thieves!"

source: قالوا وأقبلوا عليهم ماذا تفقدون
en: They, turning towards them, said: "What is it that you have lost?"

source: قالوا نفقد صواع الملك ولمن جاء به حمل بعير وأنا به زعيم
en: They said: "We have lost the (golden) bowl of the king and for him who produces it is (the reward of) a camel load; and I will be bound by it."

source: قالوا تالله لقد علمتم ما جئنا لنفسد في الأرض وما كنا سارقين
en: They said: "By Allah! Indeed you know that we came not to make mischief in the land, and we are no thieves!"

source: قالوا فما جزاؤه إن كنتم كاذبين
en: They [Yusuf's (Joseph) men] said: "What then shall be the penalty of him, if you are (proved to be) liars."

source: قالوا جزاؤه من وجد في رحله فهو جزاؤه كذلك نجزي الظالمين
en: They [Yusuf's (Joseph) brothers] said: "His penalty should be that he, in whose bag it is found, should be held for the punishment (of the crime). Thus we punish the Zalimun (wrong-doers)!"

source: فبدأ بأوعيتهم قبل وعاء أخيه ثم استخرجها من وعاء أخيه كذلك كدنا ليوسف ما كان ليأخذ أخاه في دين الملك إلا أن يشاء الله نرفع درجات من نشاء وفوق كل ذي علم عليم
en: So he [Yusuf (Joseph)] began (the search) in their bags before the bag of his brother. Then he brought it out of his brother's bag. Thus did We plan for Yusuf (Joseph). He could not take his brother by the law of the king (as a slave), except that Allah willed it. (So Allah made the brothers to bind themselves with their way of "punishment, i.e. enslaving of a thief.") We raise to degrees whom We will, but over all those endowed with knowledge is the All-Knowing (Allah).
